import { v4 as setId } from 'uuid';

function shuffle(arr) {
	for (let i = arr.length - 1; i > 0; --i) {
		const pos = Math.floor(Math.random() * (i + 1));
		const t = arr[pos];
		arr[pos] = arr[i];
		arr[i] = t;
	}
	return arr;
}


const array = [
	{
		id: setId(),
		img: "kamilla.png",
		name: "Камиллка",
		review: [
			"В такой особенный день хочу пожелать тебе и Али безмерной любви и взаимопонимания! Пусть ваша совместная жизнь будет наполнена невероятным количеством счастливых, очень радостных и приятных моментов. ",
			"Не сомневаюсь, что семья, которую вы создали будет дружной и крепкой. Берегите и цените друг друга! Пусть вам обязательно сопутствуют крепкое здоровье и благополучие. А мы - твои сёстры и братья - всегда рядом, готовые поддержать вас и помочь в любой ситуации."
		]
	},
	{
		id: setId(),
		img: "lalina.png",
		name: "Лалинка",
		review: [
			"Сестренка , от всей души поздравляю тебя с этим чудесным событием в твоей жизни ! ❤️🙏🏻 Желаю пройти все трудности , радости , испытания рука об руку с человеком, которого ты выбрала для себя ❤️‍🩹",
			"Пусть этот жизненный этап принесет тебе радость, чувство уверенности , спокойствия и стабильности 😘",
			"Пусть в семье у вас царит уют , любовь, взаимопонимание и уважение друг к другу 🙏🏻",
			"Пусть каждый твой день будет наполнен любовью, счастьем ! А также душевным теплом , которое будет согревать тебя в ненастные дни 🫶🏻",
			"Будь счастлива , родная❤️❤️❤️"
		]
	},
	{
		id: setId(),
		img: "tema.png",
		name: "Тёмка",
		review: [
			"Дана, желаю в браке оставаться такой же веселой, умной, старой (шучу) (а может и не шучу).",
			"Счастья лубви, много, много, очень много денег и  всего самого банального;)"
		]
	},
	{
		id: setId(),
		img: "idar.png",
		name: "Идарка",
		review: [
			"Дана, ты прошлась по стольким сердцам, погасила столько надежд... И все это ради чего? ",
			"Надеюсь, что ты обрела истинное счастье - встретила умного, доброго, понимающего, достойного человека.",
			"Желаю вам долгих лет новой семейной жизни, неукротимой любви, больше радости, стабильности в отношениях, а также всего самого лучшего!"
		]
	},
	{
		id: setId(),
		img: "alina.png",
		name: "Алинка",
		review: [
			"Айдан, хочу пожелать тебе счастливой семейной жизни!",
			"Пусть предстоящие годы будут наполнены крепкой любовью , взаимной поддержкой и уважением!",
			"Искренне хочу , чтобы этот союз  внес в ваши жизни много красок и много-много радости❤️"
		]
	},
	{
		id: setId(),
		img: "nai.png",
		name: "Наячка",
		review: [
			"Безусловной любви и принятия, удовольствия от жизни.",
			"И помните , что мир всегда заботиться о вас."
		]
	},
	{
		id: setId(),
		img: "dayana.png",
		name: "Дайаша",
		review: [
			"Дорогая Дана! Поздравляю тебя с Днем Свадьбы! С таким важным событием в твоей жизни, которое несёт в себе столько света, тепла, любви.",
			"Пусть этот день станет для тебя началом нового, невероятного, счастливого и интересного путешествия в семейную жизнь!",
			"От всего сердца желаю вам благополучия и взаимопонимания!",
			"Всех благ!"
		]
	},
	{
		id: setId(),
		img: "alim.png",
		name: "Алимчик",
		review: [
			"А я то думал, что у меня лучше всех получается неожиданно суету наводить, но тебе теперь нет равных)",
			"Дана, уверен свадьба будет сногсшибательной, а ты будешь выглядеть, как обычно, невероятно!",
			"Желаю тебе, как положено, всего самого-самого, достижения всех поставленных целей и исполнения всех недосягаемых желаний!",
			"Думаю, твоему жениху безумно повезло с тобой, поздравляю его! А ещё ему повезно, что он не проходил аттестацию по Mortal Kombat, но это ненадолго...",
			"Поздравляю! Будьте счаствливы!"
		]
	},
	{
		id: setId(),
		img: "kan.png",
		name: "Кантик",
		review: [
			"Хочу вам пожелать долгой и счастливой совместной жизни!",
			"Пусть ваш союз держится на любви, уважении и взаимопонимании, а каждый день будет наполнен смехом и радостью!"
		]
	},
	{
		id: setId(),
		img: "regina.png",
		name: "Региша",
		review: [
			"Дорогие Али и Айдан, желаю вам безмерного счастья, любви, взаимопонимания и благополучия, пусть на вашем пути всегда будут только искренние и добрые люди.",
			"Семейного счастья и много-много детишек 😄❤️"
		]
	},

];



export default shuffle(array);